Revit 2027 API
SchemaBuilder.AcceptableName Method
 Checks whether a string is an acceptable name for a Schema or a Field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AcceptableName(
	string name
)
Public Function AcceptableName (
	name As String
) As Boolean
public:
bool AcceptableName(
	String^ name
)
member AcceptableName :
        name : string -> bool
Parameters
name String
 The string to check.
Return Value
Boolean
 True if the name is acceptable.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 For interoperability, names are required to be usable as C++ identifiers. The allowable characters are ASCII letters, numbers (except the first character) and underscore. The length must be between 1 and 247 characters.
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace